rails/reactfineuploader/app/controllers/photos_controller.rb

SELECT  "photos".* FROM "photos" WHERE "photos"."qquuid" = ? LIMIT ?  [["qquuid", "937164b6-000a-4f8b-863a-0d94819c63f8"], ["LIMIT", 1]]
DELETE FROM "photos" WHERE "photos"."id" = ?  [["id", 9]]
---
  def destroy
    photo = Photo.find_by(qquuid: params[:qquuid])
    if photo.destroy

INSERT INTO "photos" ("name", "attachment", "qquuid", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def upload
    photo = Photo.new
    photo.name = params[:qqfilename]
    photo.qquuid = params[:qquuid]
    photo.attachment = params[:qqfile]

    if photo.save